# Lista de Exercícios 4a

# Aluno: Guilherme Santos Silva

__1.__ Considere as tabelas de vendas diárias de três lojas:

In [1]:
import numpy as np
import pandas as pd

In [2]:
Mercearia = pd.DataFrame({"loja":["A", "A", "A"], "dia": ["sex", "sab", "dom"], "valor": [7500, 9500, 8200]})

In [3]:
Farmácia = pd.DataFrame({"loja":["B", "B", "B"], "dia": ["sex", "sab", "dom"], "valor": [5100, 8250, 9900]})

In [4]:
Restaurante = pd.DataFrame({"loja":["C", "C"], "dia": ["sab", "dom"], "valor": [7500, 11800]})

__Crie dois novos dataframes por meio da junção dos três acima, agrupando, para isso,
os dataframes no sentido de linha para criar um, e no sentido de coluna para criar
o segundo. Explique as diferenças entre as duas saídas, principalmente a ocorrência
de valores NaN.__

In [5]:
pd.concat([Mercearia, Farmácia, Restaurante], ignore_index=True)

  loja  dia  valor
0    A  sex   7500
1    A  sab   9500
2    A  dom   8200
3    B  sex   5100
4    B  sab   8250
5    B  dom   9900
6    C  sab   7500
7    C  dom  11800

In [6]:
pd.concat([Mercearia, Farmácia, Restaurante], axis=1)

  loja  dia  valor loja  dia  valor loja  dia    valor
0    A  sex   7500    B  sex   5100    C  sab   7500.0
1    A  sab   9500    B  sab   8250    C  dom  11800.0
2    A  dom   8200    B  dom   9900  NaN  NaN      NaN

__2.__ Com base nos dataframes a seguir, que guardam informações de matriculas de alunos
em dois cursos, um de SQL e outro de Python:

In [7]:
SQL = pd.DataFrame({"email":["rakesh@xyz.com",
"ecg@acmecorpus.com"]})

In [8]:
PYTHON = pd.DataFrame({"email":["ana@xyz.com",
"jonas@acmecorpus.com",
"rakesh@xyz.com"]})

responda:

(a) quais são os alunos distintos, considerando ambas as listas?

(b) quais são os alunos que fizeram ambos os cursos?

(c) quais os alunos que realizaram o curso de SQL, mas não o de PYTHON (e
vice-versa)?

# Respostas

In [9]:
d = pd.concat([SQL, PYTHON], ignore_index=True)
d = d.drop_duplicates()

In [10]:
d

                  email
0        rakesh@xyz.com
1    ecg@acmecorpus.com
2           ana@xyz.com
3  jonas@acmecorpus.com

In [12]:
a = SQL.merge(PYTHON)
a

            email
0  rakesh@xyz.com

In [13]:
ap_sql = SQL[SQL.email.isin(PYTHON.email)==False]
ap_sql

                email
1  ecg@acmecorpus.com

__3.__ Considere os dois dataframes a seguir, referentes aos dados sobre os departamentos
e os funcionários de uma empresa.

In [16]:
dic_emp = {"id":["D1","D2","D3","D4"],
"nomDepto": ["Compras","RH","TI","Vendas"],
"local":["SP","RJ","RJ","SP"]}

In [17]:
dic_func = {"num":[3199,3269,3555,3788,3844],
"nome": ["Ana","David","José","Marina","Luís"],
"salario":[1600,2975,1500,5000,3000],
"idDepto": ["D2","D3",None,"D2","D4"]}

In [18]:
empresa = pd.DataFrame(dic_emp)
funcionarios = pd.DataFrame(dic_func)

__Combine os dados dos funcionários com os dados dos departamentos para criar um
novo dataframe completo sobre a empresa, usando merge.__

In [19]:
nd = pd.merge(empresa, funcionarios, left_on="id", right_on="idDepto")

In [20]:
empresa

   id nomDepto local
0  D1  Compras    SP
1  D2       RH    RJ
2  D3       TI    RJ
3  D4   Vendas    SP

In [21]:
funcionarios

    num    nome  salario idDepto
0  3199     Ana     1600      D2
1  3269   David     2975      D3
2  3555    José     1500    None
3  3788  Marina     5000      D2
4  3844    Luís     3000      D4

In [23]:
nd

   id nomDepto local   num    nome  salario idDepto
0  D2       RH    RJ  3199     Ana     1600      D2
1  D2       RH    RJ  3788  Marina     5000      D2
2  D3       TI    RJ  3269   David     2975      D3
3  D4   Vendas    SP  3844    Luís     3000      D4